glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
			if (queue_dta == 0x00)
				{
				if (heater->owp_state == 0x00)
					heater->anti_calc_state= anti_calc_protection(heater, &currtime_tm);
				else
					heater->anti_calc_state= 0x00;
				}

			if (heater->anti_calc_state)
				printf("<HTR> dev[%02d]: anti-calc protection (%d)\n", heater->indx, heater->anti_calc_timeout);



			if (thermometer)
				{

				xSemaphoreTake(thermometer_sem, 0);

				if ((queue_dta == 0x01) || !thermometer->temp_vaild)
					{
					// zerowanie, wy³¹cz grzanie

					xSemaphoreGive(thermometer_sem);

					// wy³¹czenie timera
					heater->max_throttle_timeout_active= false;
					heater->max_throttle_timeout= 0;

					heater->owp_state= 0x00;
					heater->owp_begin_time= 0;


					// wy³aczam grzanie
					duty_ratio= 0;


					// anti-calc protection
					if (heater->anti_calc_state)
						{
						duty_ratio= PWM_DUTY_RATIO_MAX;
						heater->pid_state= HTR_PID_STATE_ANTI_CALC_PROT;
						}


					if (heater_ctrl_handler->duty_ratio != duty_ratio)
						pwm_channel_set(heater_ctrl_handler, duty_ratio);

					} // init
				else
					xSemaphoreGive(thermometer_sem);

				} // if (thermometer)
			else
				{
				// brak zdefiniowanego termometru dla grzejnika
				// wy³¹czam grzanie dla danego grzejnika

				// wy³¹czenie timera
				heater->max_throttle_timeout_active= false;
				heater->max_throttle_timeout= 0;

				heater->owp_state= 0x00;
				heater->owp_begin_time= 0;


				// wy³aczam grzanie
				duty_ratio= 0;


				// anti-calc protection
				if (heater->anti_calc_state)
					{
					duty_ratio= PWM_DUTY_RATIO_MAX;
					heater->pid_state= HTR_PID_STATE_ANTI_CALC_PROT;
					}


				if (heater_ctrl_handler->duty_ratio != duty_ratio)
					pwm_channel_set(heater_ctrl_handler, duty_ratio);

				printf("<HTR> dev[%02d]: thermometer not found\n", heater->indx);

				goto prvTempCtrlPIDTask_next_therm;
				}




			switch (main_settings.global_mode)
				{

//--------------------------------------------------------------

				case GLOBAL_MODE_IDLE:
					{

					// wy³¹czenie timera
					heater->max_throttle_timeout_active= false;
					heater->max_throttle_timeout= 0;


					xSemaphoreTake(thermometer_sem, 0);

					if (thermometer && (queue_dta == 0x00) && thermometer->temp_vaild)
						{

						heater_temp= (k_long)thermometer->temp_value;
						xSemaphoreGive(thermometer_sem);

						heater_temp*= 1000;
						heater_temp>>= 4;

						if (heater->temp_offset != 0)
							heater_temp+= heater->temp_offset;

						heater->temp_current= heater_temp;



						// wy³aczam grzanie
						duty_ratio= 0;


						// anti-calc protection
						if (heater->anti_calc_state)
							{
							duty_ratio= PWM_DUTY_RATIO_MAX;
							heater->pid_state= HTR_PID_STATE_ANTI_CALC_PROT;
							}


						// zabezpieczenie przed nadmiernym spadkiem temperatury, nawet przy otwartym oknie
						if (heater->temp_current < MIN_TEMPERATURE)
							{
							printf("<HTR> dev[%02d]: OPENED, MIN_TEMPERATURE tmin=%2.3f\n", heater->indx, (float)MIN_TEMPERATURE/1000.0);
							duty_ratio= PWM_DUTY_RATIO_MAX;
							heater->pid_state= HTR_PID_STATE_MIN_TEMPERATURE;
							}


						if (heater_ctrl_handler->duty_ratio != duty_ratio)
							pwm_channel_set(heater_ctrl_handler, duty_ratio);


						} // if (thermometer && (queue_dta == 0x00) && thermometer->temp_vaild)
					else
						xSemaphoreGive(thermometer_sem);




					break;
					} // GLOBAL_MODE_IDLE

//--------------------------------------------------------------

				case GLOBAL_MODE_HEATING:
					{

					xSemaphoreTake(thermometer_sem, 0);

					if (thermometer && (queue_dta == 0x00) && thermometer->temp_vaild)
						{

						heater_temp= (k_long)thermometer->temp_value;
						xSemaphoreGive(thermometer_sem);



						// obs³uga harmonogramu prze³¹czania temperatury zadanej
						// sprawdzam w ka¿dej 10-tej minucie, np. 12:00, 12:10, 12:20, ...

						if (heater->temp_setpoint_forced_timeout != 0)
							{

							if (heater->temp_setpoint_forced_timeout >= time_elapsed_sec)
								heater->temp_setpoint_forced_timeout-= time_elapsed_sec;
							else
								heater->temp_setpoint_forced_timeout= 0;

							if (heater->temp_setpoint_forced_timeout != 0)
								{
								k_uchar pred_indx= heater->pred_temp_indx_forced;
								k_uchar *pred_addr= temp_preconfig_tab + (int)((pred_indx >> 1) * 4 + (pred_indx & 1));

								user_temp= (k_long)(*(k_uchar *)pred_addr) * 500;

								if (heater->temp_setpoint != user_temp)
									{
									heater->PID_data.uchyb_prev= 0x80000000; // magic value
									heater->PID_data.I_prev= 0;
									}

								heater->temp_setpoint= user_temp;

								printf("<HTR> dev[%02d]: temp setpoint forced [%d]: %d\n", heater->indx, pred_indx, heater->temp_setpoint_forced_timeout);
								}
							else
								{
								// koniec wartosci wymuszonej
								// wymuszam odczyt nastawy z harmonogramu
								heater->temp_setpoint= 0;
								}

							} // temp_setpoint_forced_timeout

						if (((heater->temp_setpoint_forced_timeout == 0) && ((currtime_tm.tm_sec < THERMOMETER_READ_PERIOD) && ((currtime_tm.tm_min % 10) == 0))) || (heater->temp_setpoint == 0))
							{

							if (usersettings_get(heater->indx, &currtime_tm, &user_temp) == 0)
								{

								if (heater->temp_setpoint != user_temp)
									{
									heater->PID_data.uchyb_prev= 0x80000000; // magic value
									heater->PID_data.I_prev= 0;
									}

								heater->temp_setpoint= user_temp;
								}
							else
								{
								// nie znaleziono nastaw

								k_uchar pred_indx= HEATER_TEMP_DAY_LIFE;
								k_uchar *pred_addr= temp_preconfig_tab + (int)((pred_indx >> 1) * 4 + (pred_indx & 1));

								user_temp= (k_long)(*(k_uchar *)pred_addr) * 500;

								if (heater->temp_setpoint != user_temp)
									{
									heater->PID_data.uchyb_prev= 0x80000000; // magic value
									heater->PID_data.I_prev= 0;
									}

								heater->temp_setpoint= user_temp;

								printf("<HTR> dev[%02d]: not defined temperature settings\n", heater->indx);
								}

							} // obs³uga harmonogramu prze³¹czania temperatury zadanej







