glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
						heater_temp*= 1000;
						heater_temp>>= 4;

						if (heater->temp_offset != 0)
							heater_temp+= heater->temp_offset;

						heater->temp_current= heater_temp;
						temp_uchyb= heater->temp_setpoint - heater_temp;

						if (heater->PID_data.uchyb_prev == 0x80000000)
							heater->PID_data.uchyb_prev= temp_uchyb;

						ctrl_param= temp_pid_process(&heater->PID_data, temp_uchyb);

						duty_ratio= (uint16_t)round((((float)ctrl_param / (float)PID_REG_MAX) * pwm_duty_ratio_max));



						if (duty_ratio > pwm_duty_ratio_max)
							{
							duty_ratio= pwm_duty_ratio_max;
							heater->pid_state= HTR_PID_STATE_HEATING_MAX;
							}
						else
						if (duty_ratio < PWM_DUTY_RATIO_CUTOFF)
							{
							printf("<HTR> dev[%02d]: CLOSED\n", heater->indx);
							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_IDLE;
							}
						else
							heater->pid_state= HTR_PID_STATE_HEATING;

						if ((duty_ratio > 0) && (temp_uchyb <= 0))
							{
							printf("<HTR> dev[%02d]: CLOSED, OVERHEATING\n", heater->indx);
							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_OVERHEATING;
							}


						// zabezpieczenie przed ci¹g³ym za³¹czeniem grzania na full, w przypadku, gdy np. wy³aczony jest piec
						// jesli czas otwarcia na full (np. > 800) trwa powyzej x sekund, to za³¹czyc pwm na podtrzymanie

						if ((heater->max_throttle_timeout_active == true) && (duty_ratio < 800))
							{
							// wy³¹czenie timera
							heater->max_throttle_timeout_active= false;
							heater->max_throttle_timeout= 0;
							printf("<HTR> dev[%02d]: full throttle timer stop\n", heater->indx);
							}

						if (heater->max_throttle_timeout_active == true)
							{
							if (heater->max_throttle_timeout != 0)
								{
								if (heater->max_throttle_timeout >= time_elapsed_sec)
									heater->max_throttle_timeout-= time_elapsed_sec;
								else
									heater->max_throttle_timeout= 0;
								}

							if (heater->max_throttle_timeout == 0)
								{
								printf("<HTR> dev[%02d]: full throttle limiter\n", heater->indx);
								duty_ratio= PWM_WARM_CONST_FACTOR;
								heater->pid_state= HTR_PID_STATE_FULLTHR_LIMITER;

								// anti-calc protection, kasuj
								if ((currtime_tm.tm_mday >= 16) && (*heater_anticalc_status & (1 << heater->indx)))
									STM32_BKP_REG_BYTE_WR(heater_anticalc_status, (*heater_anticalc_status & (~(k_uchar)(1 << heater->indx))));

								}
							else
								printf("<HTR> dev[%02d]: full throttle timer: %03d\n", heater->indx, heater->max_throttle_timeout);
							}

						if ((heater->owp_state == 0x00) && (duty_ratio > 900) && (heater->max_throttle_timeout_active == false))
							{
							// za³¹czenie timera
							heater->max_throttle_timeout= PWM_MAX_THROTTLE_TIMEOUT;
							heater->max_throttle_timeout_active= true;

							printf("<HTR> dev[%02d]: full throttle timer start\n", heater->indx);
							}


						if (open_window_status(heater))
							{
							// wykryto otwarcie okna, wy³¹czam grzanie

							printf("<HTR> dev[%02d]: CLOSED, OPEN WINDOW PROTECTION\n", heater->indx);

							// wy³¹czenie timera
							heater->max_throttle_timeout_active= false;
							heater->max_throttle_timeout= 0;

							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_OWP;
							} // open_window_status




						// zabezpieczenie przed maksymaln¹ temperatur¹
						if ((duty_ratio != 0) && (heater->temp_current >= MAX_TEMPERATURE))
							{
							// przekroczono dozwolon¹ maksymaln¹ temperaturê
							printf("<HTR> dev[%02d]: CLOSED, MAX_TEMPERATURE tmax=%2.3f\n", heater->indx, (float)MAX_TEMPERATURE/1000.0);
							duty_ratio= 0;
							heater->pid_state= HTR_PID_STATE_MAX_TEMPERATURE;
							}

						// zabezpieczenie przed nadmiernym spadkiem temperatury, nawet przy otwartym oknie
						if (heater->temp_current < MIN_TEMPERATURE)
							{
							printf("<HTR> dev[%02d]: OPENED, MIN_TEMPERATURE tmin=%2.3f\n", heater->indx, (float)MIN_TEMPERATURE/1000.0);
							duty_ratio= PWM_DUTY_RATIO_MAX;
							heater->pid_state= HTR_PID_STATE_MIN_TEMPERATURE;
							}

						// anti-calc protection
						if (heater->anti_calc_state)
							{
							duty_ratio= PWM_DUTY_RATIO_MAX;
							heater->pid_state= HTR_PID_STATE_ANTI_CALC_PROT;
							}



						printf("<HTR> dev[%02d]: state[%x] therm[%02X] tset=%2.3f toff=%2.3f tdiff=%2.3f\n", heater->indx, heater->pid_state, heater->thermometer->indx, (float)heater->temp_setpoint/1000, (float)heater->temp_offset/1000, (float)temp_uchyb/1000);
						printf("<HTR> dev[%02d]: PID: %4d %4d %4d \n", heater->indx, heater->PID_data.P/1000, heater->PID_data.I/1000, heater->PID_data.D/1000);
						printf("<HTR> dev[%02d]: PID param: %05d  duty_ratio: %04d\n", heater->indx, ctrl_param, duty_ratio);


						if (heater_ctrl_handler->duty_ratio != duty_ratio)
							{
							printf("<HTR> dev[%02d]: PWM duty ratio set to:  %04d\n", heater->indx, duty_ratio);
							pwm_channel_set(heater_ctrl_handler, duty_ratio); // 0 -- pwm_duty_ratio_max
							}


						} // if (thermometer && (queue_dta == 0x00) && thermometer->temp_vaild)
					else
						xSemaphoreGive(thermometer_sem);


					break;
					} // GLOBAL_MODE_HEATING

//--------------------------------------------------------------

				default:
					{
					main_settings.global_mode= GLOBAL_MODE_IDLE;
					break;
					}


				} // switch (main_settings.global_mode)



	prvTempCtrlPIDTask_next_therm:

			heater->temp_prev= heater->temp_current;

			heater_entry= heater_entry->next;

			} //while (heater_entry)


		if (queue_dta == 0x00)
			tempctrl_write2logfile();



		} // while (1)

	}

//-----------------------------------------------------------------------------

k_long temp_pid_process(PID_data_s *PID_data, k_long uchyb)
	{
	k_long result;
    
	PID_data->P= Kp * uchyb;
	PID_data->I= Ki * (uchyb + PID_data->uchyb_prev) / 2 + PID_data->I_prev;
	PID_data->D= Kd * (uchyb - PID_data->uchyb_prev);
	
