glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
	PID_data->uchyb_prev= uchyb;
	result= PID_data->P + PID_data->I + PID_data->D;
	result/= 1000;

	if (result < PID_REG_MIN)
        result= PID_REG_MIN;
	else
	if (result > PID_REG_MAX)
		result= PID_REG_MAX;
	else
		PID_data->I_prev= PID_data->I;

	return result;
	}

//-----------------------------------------------------------------------------

k_long pwm_channel_init(heater_ctrl_handler_s *heater_ctrl_handler)
	{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	uint16_t PrescalerValue;

	static unsigned char GPIOx_clk_enable= 0x00;
	static unsigned char pwm_timer_enabled= 0x00;


	if (!heater_ctrl_handler)
		return -1;

	switch (heater_ctrl_handler->peripheral_addr)
		{

		case (uint32_t)GPIOB:
			{

			if (!(GPIOx_clk_enable & GPIOB_CLK_ENABLE_BIT))
				{
				// only once
				RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
				GPIOx_clk_enable|= GPIOB_CLK_ENABLE_BIT;
				}

			break;
			} // GPIOB

		default:
			{
			return -1;
			}

		} // switch (heater_ctrl_handler->peripheral_addr)


	if (!pwm_timer_enabled)
		{

		PrescalerValue= (uint16_t)(SystemCoreClock / PWM_TIMER_FREQ) - 1;

		if ((SystemCoreClock / PWM_TIMER_FREQ) >= 0x10000)
			printf("<ERR> %s: TIM_Prescaler overrange !\n", __FUNCTION__);

		if (((int)heater_ctrl_handler->period * PWM_TIMER_FREQ) >= 0x10000)
			printf("<ERR> %s: TIM_Period overrange !\n", __FUNCTION__);

		// TIMx configuration
		TIM_TimeBaseStructure.TIM_Period= (uint16_t)(heater_ctrl_handler->period * PWM_TIMER_FREQ);
		TIM_TimeBaseStructure.TIM_Prescaler= PrescalerValue;
		TIM_TimeBaseStructure.TIM_ClockDivision= 0;
		TIM_TimeBaseStructure.TIM_CounterMode= TIM_CounterMode_Up;
		TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

		// Immediate load of TIM2,TIM3 and TIM4 Prescaler values
		TIM_PrescalerConfig(TIM4, PrescalerValue, TIM_PSCReloadMode_Immediate);

		TIM_ARRPreloadConfig(TIM4, ENABLE);

		// TIM2, TIM3 and TIM4 enable counters
		TIM_Cmd(TIM4, ENABLE);



		pwm_timer_enabled= 0x01;
		}


	GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
	GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
	GPIO_ResetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);


	heater_ctrl_handler->duty_ratio= 0;

	return 0;
	}

//-----------------------------------------------------------------------------

k_long pwm_channel_set(heater_ctrl_handler_s *heater_ctrl_handler, uint16_t duty_ratio)
	{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	float duty_f;


	if (!heater_ctrl_handler)
		return -1;


	if (duty_ratio > 1000)
		duty_ratio= 1000;

	heater_ctrl_handler->duty_ratio= duty_ratio;

	if (heater_ctrl_handler->peripheral_addr == NULL)
		return -1;


	if (duty_ratio == 0)
		{
		// PWM OFF

		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
		GPIO_ResetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);

		//TIM_Cmd(TIM3, DISABLE);

		}
	else
	if (duty_ratio == 1000)
		{
		// static ON

		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);
		GPIO_SetBits((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, heater_ctrl_handler->ctrl_pin);

		//TIM_Cmd(TIM3, DISABLE);

		}
	else
		{
		// PWM ON

		//TIM_Cmd(TIM3, DISABLE);
/*
		PrescalerValue= (uint16_t)(SystemCoreClock / PWM_TIMER_FREQ) - 1;

		// Immediate load of TIM2,TIM3 and TIM4 Prescaler values
		TIM_PrescalerConfig(TIM3, PrescalerValue, TIM_PSCReloadMode_Immediate);
*/
		duty_f= (float)(heater_ctrl_handler->period * PWM_TIMER_FREQ) * (float)duty_ratio / 1000;

		// Output Compare Timing Mode configuration: Channel1
		TIM_OCStructInit(&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
		TIM_OCInitStructure.TIM_OutputState= TIM_OutputState_Enable;
		TIM_OCInitStructure.TIM_Pulse= (uint16_t)duty_f;
		TIM_OCInitStructure.TIM_OCPolarity= TIM_OCPolarity_High;

		switch (heater_ctrl_handler->pwm_chn)
			{

			case 1:
				{
				TIM_OC1Init(TIM4, &TIM_OCInitStructure);
				TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 2:
				{
				TIM_OC2Init(TIM4, &TIM_OCInitStructure);
				TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 3:
				{
				TIM_OC3Init(TIM4, &TIM_OCInitStructure);
				TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			case 4:
				{
				TIM_OC4Init(TIM4, &TIM_OCInitStructure);
				TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
				break;
				}

			} // switch (heater_ctrl_handler->pwm_chn)


		//TIM_ARRPreloadConfig(TIM3, ENABLE);

		// TIM2, TIM3 and TIM4 enable counters
		//TIM_Cmd(TIM3, ENABLE);



		GPIO_InitStructure.GPIO_Pin= heater_ctrl_handler->ctrl_pin;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode= GPIO_Mode_AF_PP;
		GPIO_Init((GPIO_TypeDef *)heater_ctrl_handler->peripheral_addr, &GPIO_InitStructure);

		}


	return 0;
	}

//-----------------------------------------------------------------------------

k_long open_window_status(heater_s *heater)
	{
	time_t now;

	if (!heater)
		return 0;


	now= time(0);

	switch (heater->owp_state)
		{

		case 0x00:
			{
			// detekcja otwarcia okna

			if (heater->owp_begin_time == 0)
				{
				if (heater->temp_current < heater->temp_prev)
					{
					heater->owp_begin_time= now;
					heater->owp_begin_temp= heater->temp_prev;
					}
				}
			else
			if (heater->temp_current >= heater->owp_begin_temp)
				{
				heater->owp_begin_time= 0;
				}
			else
			if ((now - heater->owp_begin_time) <= 600)
				{
				if ((heater->owp_begin_temp - heater->temp_current) >= 2000)
					{
					// wykryto otwarte okno
					// temperatura spad³a o zadan¹ wartosc w czasie krotszym niz ...
					heater->owp_begin_time= now;
					heater->owp_begin_temp= 99999;
					heater->owp_state= 0x01;

