glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
					printf("<HTR> dev[%02d]: window opened\n", heater->indx);
					}
				}
			else
				{
				// timeout
				// temperatura nie spadla przez zadany okres
				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;
				}

			break;
			}

		case 0x01:
			{
			// detekcja zamkniêcia okna

			if (heater->temp_current < heater->owp_begin_temp)
				heater->owp_begin_temp= heater->temp_current;
			else
			if ((heater->temp_current - heater->owp_begin_temp) >= 1000)
				{
				// odbicie temperatury od minumum
				// wykryto zamkniête okno

				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;

				printf("<HTR> dev[%02d]: window closed\n", heater->indx);
				}
			else
			if ((now - heater->owp_begin_time) >= 1800) // zabezpieczenie czasowe, jêsli nie by³o odbicia temperatury od minimum
				{
				// timeout 30 min
				// zamkniete okno

				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;

				printf("<HTR> dev[%02d]: window closed, timeout\n", heater->indx);
				}

			break;
			}

		default:
			{
			heater->owp_begin_time= 0;
			heater->owp_state= 0x00;
			break;
			}

		} // switch (heater->owp_state)


	printf("opw: %02X tb %d, td %d, temp_now %5d, temp_prev %5d, temp_begin %5d\n", heater->owp_state, heater->owp_begin_time, now - heater->owp_begin_time, heater->temp_current, heater->temp_prev, heater->owp_begin_temp);

	return heater->owp_state;
	}

//-----------------------------------------------------------------------------

k_uchar anti_calc_protection(heater_s *heater, struct tm *current_time)
	{
	k_uchar result= 0;

	if (!heater || !current_time)
		return 0;


	if (heater->anti_calc_state == 1)
		{

		if (heater->anti_calc_timeout > THERMOMETER_READ_PERIOD)
			heater->anti_calc_timeout-= THERMOMETER_READ_PERIOD;
		else
			heater->anti_calc_timeout= 0;

		if (heater->anti_calc_timeout == 0)
			{
			// zakonczenie
			STM32_BKP_REG_BYTE_WR(heater_anticalc_status, (*heater_anticalc_status & (~(k_uchar)(1 << heater->indx)))); // kasuj status
			result= 0;
			}
		else
			result= 1; // zadzia³anie

		return result;
		}



	if (!(*heater_anticalc_status & (1 << heater->indx)))
		return 0;

	if ((current_time->tm_wday != 0) || (current_time->tm_mday > 7))
		return 0;

	if (current_time->tm_hour < 21)
		return 0;

	heater->anti_calc_timeout= ANTI_CALC_TIMEOUT;
	return 1; // zadzia³anie
	}

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

void tempctrl_write2logfile()
	{
	FRESULT res;
	UINT br;
	wdlist_entry_s *heater_entry= NULL;
	heater_s *heater;

	static u8 buffer_tmp[64];
	static u8 logfile_buffer[LOGFILE_BUFFER_LENGTH];


	if (!logfile_open_f)
		{

		if (SD_Detect() == SD_PRESENT)
			{
			res= f_mount(0, &fs);

			sprintf(logfile_buffer, "0:/");
			strftime(buffer_tmp, 16, "%Y%m%d", &currtime_tm);
			strcat(logfile_buffer, buffer_tmp);
			strcat(logfile_buffer, ".csv");
			res= f_open(&fsrc, logfile_buffer, FA_OPEN_ALWAYS | FA_WRITE);
			printf("f_open: %s\n", (res == FR_OK) ? "success" : "fail");

			if (res == FR_OK)
				{
				res= f_lseek(&fsrc, f_size(&fsrc));
				printf("f_lseek: %s\n", (res == FR_OK) ? "success" : "fail");

				logfile_open_f= true;
				}
			}

		} // if (!logfile_open_f)


	if (!logfile_open_f)
		return ;

	if (SD_Detect() != SD_PRESENT)
		{
		printf("SD CARD: not present\n");

		logfile_open_f= false;
		f_close(&fsrc);

		f_mount(0, NULL); // umount

		return ;
		}

	strftime(logfile_buffer, LOGFILE_BUFFER_LENGTH, "%H:%M:%S", &currtime_tm);

	sprintf(buffer_tmp, ";%d", main_settings.global_mode);
	strcat(logfile_buffer, buffer_tmp);

	heater_entry= heater_list.first_entry;
	while (heater_entry)
		{
		heater= (heater_s *)heater_entry->data;

		sprintf(buffer_tmp, ";%d;%d;%d;%d;%2.3f;%2.3f;%2.3f;%d;%d;%d;%d",
			heater->state,
			heater->PID_data.P/1000,
			heater->PID_data.I/1000,
			heater->PID_data.D/1000,
			(float)heater->temp_setpoint/1000,
			(float)heater->temp_offset/1000,
			(float)heater->temp_current/1000,
			heater->pid_state,
			heater->heater_ctrl_handler->duty_ratio,
			heater->max_throttle_timeout_active,
			heater->max_throttle_timeout
			);

		strcat(logfile_buffer, buffer_tmp);

		heater_entry= heater_entry->next;
		}

//	printf("%s\n", logfile_buffer);
	strcat(logfile_buffer, "\r\n");

	res= f_write(&fsrc, logfile_buffer, strlen(logfile_buffer), &br);
	f_sync(&fsrc);

	}

//-----------------------------------------------------------------------------


/*

heater <number> pwm <value>

*/

void cmdline_heater_param_set(unsigned char *param)
	{
	unsigned char *tokptr;
	k_uchar indx= 0;

	heater_s *heater= NULL;
	k_uchar cmd= 0xFF;
	k_uchar nparam= 0;

	const k_uchar max_nparam= 3;
	k_ulong paramsval[max_nparam];

	while (param)
		{

		switch (indx)
			{

			case 0:	// indeks grzejnika
				{
				wdlist_entry_s *entry;
				heater_s *heater_tmp;
				k_uchar hindx;

				hindx= atoi(param);

				entry= heater_list.first_entry;
				while (entry)
					{
					heater_tmp= (heater_s *)entry->data;

					if (heater_tmp->indx == hindx)
						{
						heater= heater_tmp;
						break;
						}

					entry= entry->next;
					}

				break;
				}


			case 1:
				{

				if (!strcmp(param, "pwm"))
					cmd= 0x01;
				else
				if (!strcmp(param, "temp"))
					cmd= 0x02;

				break;
				}

			default:
				{

				if (nparam < max_nparam)
					{
					paramsval[nparam]= atoi(param);
					nparam++;
					}

				break;
				}

			} // switch (indx)

		indx++;
		param= strtok(NULL, cmd_inter_strtok_del);
		}


	if (heater)
		{

		switch (cmd)
			{

			case 0x01:	// pwm
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: PWM set to %d\n", heater->indx, paramsval[0]);
					pwm_channel_set(heater->heater_ctrl_handler, paramsval[0]);
					}
				break;
				}

			case 0x02:	// temperatura zadana
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: temp set to %d\n", heater->indx, paramsval[0]);

					heater->temp_setpoint= paramsval[0];

